{
    "Welcome": {
    	"storyLevel": 1,
    	"preMessage": "Hey, welcome back to the village! You can move by touching the screen with your left thumb, and then moving it in the direction you want to go.\nNow press 'Ok' and go to speak to the other villagers.",
    	"postMessage": "",
    	"minimumStoryLevel": 0,
    	"maximumStoryLevel": 0,
    	"experience": 0,
    	"targetX": 0,
    	"targetY": 0,
    	"targetZ": 0
    },
    "The arrow": {
    	"storyLevel": 2,
    	"preMessage": "Woo!! That colored scarf!!! It's such a good piece of news, you must tell it right away to the chief of the village!!\nDo you see the arrow on the top of the screen? It will guide you to him.",
    	"postMessage": "",
    	"minimumStoryLevel": 1,
    	"maximumStoryLevel": 1,
    	"experience": 0,
    	"targetX": 285.98,
    	"targetY": 403.33,
    	"targetZ": 0
    },
    "Initial story": {
    	"storyLevel": 3,
    	"preMessage": "Oh!! I couldn't believe it until I saw it! Do you you know it's been ages since our last colored item was found on this planet?\nWait... it must be a sign... go to the south and speak to the Old Man, he will explain everithing to you. I feel that after your discovery something could change in this world: I put all my hope on you. ",
    	"postMessage": "",
    	"minimumStoryLevel": 2,
    	"maximumStoryLevel": 2,
    	"experience": 0,
    	"targetX": 235.96,
    	"targetY": 347.69,
    	"targetZ": 0
    },
    "The prophecy": {
    	"storyLevel": 4,
    	"preMessage": "So the chief of the village sent you to me, ahn? Wait... what do my old eyes see? It's a colored scarf!! What a unique event!! Now I'll tell you a story. In this world there have always been two races: the Trilight, lively and cheerful beings able to control the colors, and the Klamers, loyal and combative beings who protected the Trilight and fed with colors. However, at a certain point this harmony got broken: the Klamers prevailed and stole all the colors from this world, leaving our race heart-sick and unable to be useful to the world.",
    	"postMessage": "",
    	"minimumStoryLevel": 3,
    	"maximumStoryLevel": 3,
    	"experience": 0,
    	"targetX": 278.7509,
    	"targetY": 324.5834,
    	"targetZ": 0
    },
    "First enemy": {
    	"storyLevel": 5,
    	"preMessage": "Waaaa!! An enemy spider, watch out!! You can't fight enemies at the moment, so just run!! Keep on going south to the Sanctuary",
    	"postMessage": "",
    	"minimumStoryLevel": 4,
    	"maximumStoryLevel": 4,
    	"experience": 0,
    	"targetX": 244.66,
    	"targetY": 282.85,
    	"targetZ": 0
    },
    "Sanctuary gate": {
    	"storyLevel": 6,
    	"preMessage": "Here you are. This is the Green Sanctuary gate.",
    	"postMessage": "",
    	"minimumStoryLevel": 5,
    	"maximumStoryLevel": 5,
    	"experience": 0,
    	"targetX": 0,
    	"targetY": 0,
    	"targetZ": 0
    }
}